ec2-galera/vanilla-tx-1/add_5_5100.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 5

Doing OLTP test.
Running mixed OLTP test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 4 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            169512
        write:                           60540
        other:                           24216
        total:                           254268
    transactions:                        12108  (2.37 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 230052 (45.10 per sec.)
    other operations:                    24216  (4.75 per sec.)

Test execution summary:
    total time:                          5100.4249s
    total number of events:              12108
    total time taken by event execution: 25501.6705
    per-request statistics:
         min:                                 42.75ms
         avg:                               2106.18ms
         max:                               9619.03ms
         approx.  95 percentile:            4432.17ms

Threads fairness:
    events (avg/stddev):           2421.6000/11.15
    execution time (avg/stddev):   5100.3341/0.04